Revit 2026 API

# RebarCouplerCouplerMark Property

---

gets and sets the coupler mark

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CouplerMark { get; set; }
```
```vb
Public Property CouplerMark As String
	Get
	Set
```
```cpp
public:
property String^ CouplerMark {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member CouplerMark : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

RebarCoupler Class

Autodesk.Revit.DB.Structure Namespace